app/views/messages/_side_bar.html.haml

  .side_bar__group-list
    - current_user.groups.each do |group|
      .group
---
SELECT `groups`.* FROM `groups` INNER JOIN `group_users` ON `groups`.`id` = `group_users`.`group_id` WHERE `group_users`.`user_id` = 1

            = group.name
          %p.group__message
---
SELECT  `messages`.* FROM `messages` WHERE `messages`.`group_id` = 1 ORDER BY `messages`.`id` DESC LIMIT 1