app/views/groups/edit.html.haml

  = f.text_field :name, class: "chat-group-form__input", placeholder: "グループ名を入力してください。"
  = f.collection_check_boxes :user_ids, User.all, :id, :name
---
SELECT `users`.* FROM `users`