app/views/groups/new.html.haml

SELECT `users`.* FROM `users`
---
  = f.text_field :name, class: "chat-group-form__input", placeholder: "グループ名を入力してください。"
  = f.collection_check_boxes :user_ids, User.all, :id, :name